app/views/profiles/_form.html.erb

        <ul class="list-group ">
          <% @profile.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" INNER JOIN "userprojects" ON "projects"."id" = "userprojects"."project_id" WHERE "userprojects"."profile_id" = ?  [["profile_id", 980190962]]