app/views/projects/_form.html.erb

SELECT  1 AS one FROM "profiles" INNER JOIN "userprojects" ON "profiles"."id" = "userprojects"."profile_id" WHERE "userprojects"."project_id" = ? AND "profiles"."id" = 6 LIMIT 1  [["project_id", 12]]
SELECT "profiles".* FROM "profiles" INNER JOIN "userprojects" ON "profiles"."id" = "userprojects"."profile_id" WHERE "userprojects"."project_id" = ?  [["project_id", 12]]
---
  <%# if current_user == @profile %>
  <% if @project.profiles.include?(current_user)%>

SELECT  "projects".* FROM "projects" INNER JOIN "userprojects" ON "projects"."id" = "userprojects"."project_id" WHERE "userprojects"."profile_id" = ?  ORDER BY "projects"."id" ASC LIMIT 1  [["profile_id", 6]]
---
        <% @project.profiles.each do |profile| %>
          <% creator_project = profile.projects.first%>