app/views/projects/_thumbnailbar.html.erb

SELECT  "projectpictures".* FROM "projectpictures"  WHERE "projectpictures"."project_id" = ?  ORDER BY "projectpictures"."id" ASC LIMIT 1  [["project_id", 980190962]]
---
	<ul id='thumbnailbar' class="list-group scrollable">
		<% project.projectpictures.each do |projectpicture| %>