app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "bio", "created_at", "email", "first_name", "image_url", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @profile.update_attributes(profile_params)
---
UPDATE "profiles" SET "bio" = ?, "email" = ?, "image_url" = ?, "updated_at" = ? WHERE "profiles"."id" = 4  [["bio", ""], ["email", ""], ["image_url", ""], ["updated_at", "2014-10-04 18:13:17.316978"]]

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = 6  ORDER BY "profiles"."id" ASC LIMIT 1