app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "userprojects" ("created_at", "profile_id", "project_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-06 00:58:53.299852"], ["profile_id", 3], ["project_id", 6], ["updated_at", "2014-10-06 00:58:53.299852"]]
---
  def create
    @project = Project.new(project_params)

      if logged_in?
        respond_to do |format|
          if @project.save
            # think this should save the user I think
            @userproject = Userproject.create!(profile: current_user, project: @project)

UPDATE "projects" SET "description" = ?, "title" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["description", "words here"], ["title", "title"], ["updated_at", "2014-09-20 21:43:03.621064"]]
---
  def update
    if @project.update_attributes(project_params)