app/controllers/sessions_controller.rb

INSERT INTO "profiles" ("created_at", "email", "first_name", "last_name", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-30 00:38:22.119403"], ["email", "fake@fake.com"], ["first_name", "jacob"], ["last_name", "Von Lastname"], ["uid", 0], ["updated_at", "2014-09-30 00:38:22.119403"]]
---
	def test_login
		user = Profile.from_fakeuser(params[:firstname])
		set_logged_in_userid user.id
		user.save!